## Plan Result (prod_frontdoor - TerraformPlanApply)




<pre><code>Plan: 50 to add, 20 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;court-tribunal-hearings&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;court-tribunal-hearings-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;court-tribunal-hearings-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;dts-legacy-apps---certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;dts-legacy-apps---civilappeals-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;dts-legacy-apps---courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;dts-legacy-apps---immigration-appeals-iacfees&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;dts-legacy-apps---redirect-service&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;ejudiciary-home&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;ejudiciary-home-apex&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;ejudiciary-home-www&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;sds-build&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;sds-sandbox-build&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;static-sds-sandbox-build&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;court-tribunal-hearings&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;court-tribunal-hearings-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;court-tribunal-hearings-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;dts-legacy-apps---certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;dts-legacy-apps---civilappeals-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;dts-legacy-apps---courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;dts-legacy-apps---immigration-appeals-iacfees&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;dts-legacy-apps---redirect-service&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;ejudiciary-home&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;ejudiciary-home-apex&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;ejudiciary-home-www&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;sds-build&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;sds-sandbox-build&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;static-sds-sandbox-build&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-video-web&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;court-tribunal-hearings&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;court-tribunal-hearings-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;court-tribunal-hearings-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dts-legacy-apps---certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dts-legacy-apps---civilappeals-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dts-legacy-apps---courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dts-legacy-apps---immigration-appeals-iacfees&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dts-legacy-apps---redirect-service&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["c100-application"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/c100applicationcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/c100-application"
        name                            = "c100-application"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["court-tribunal-hearings"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/courttribunalhearingscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/court-tribunal-hearings"
        name                            = "court-tribunal-hearings"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["court-tribunal-hearings-b2c-sign-in"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/court-tribunal-hearings-b2c-sign-in"
        name                            = "court-tribunal-hearings-b2c-sign-in"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["court-tribunal-hearings-b2c-staff"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/court-tribunal-hearings-b2c-staff"
        name                            = "court-tribunal-hearings-b2c-staff"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["darts-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/darts-portal"
        name                            = "darts-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dts-legacy-apps---certificatedbailiffs"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/dtslegacyappscertificatedbailiffscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/dts-legacy-apps---certificatedbailiffs"
        name                            = "dts-legacy-apps---certificatedbailiffs"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dts-legacy-apps---civilappeals-casetracker"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/dtslegacyappscivilappealscasetrackercaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/dts-legacy-apps---civilappeals-casetracker"
        name                            = "dts-legacy-apps---civilappeals-casetracker"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dts-legacy-apps---courtfines"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/dtslegacyappscourtfinescaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/dts-legacy-apps---courtfines"
        name                            = "dts-legacy-apps---courtfines"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dts-legacy-apps---immigration-appeals-iacfees"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/dtslegacyappsimmigrationappealsiacfeescaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/dts-legacy-apps---immigration-appeals-iacfees"
        name                            = "dts-legacy-apps---immigration-appeals-iacfees"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dts-legacy-apps---redirect-service"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/dtslegacyappsredirectservicecaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/dts-legacy-apps---redirect-service"
        name                            = "dts-legacy-apps---redirect-service"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["jd-bureau"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/jdbureaucaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/jd-bureau"
        name                            = "jd-bureau"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-bureau"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/juror-bureau"
        name                            = "juror-bureau"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/juror-public"
        name                            = "juror-public"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/portal"
        name                            = "portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pre-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/preportalcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/pre-portal"
        name                            = "pre-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["sds-api-mgmt"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/sds-api-mgmt"
        name                            = "sds-api-mgmt"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["toffee"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/ruleSets/toffeecaching",
        ] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/toffee"
        name                            = "toffee"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/vh-admin-web"
        name                            = "vh-admin-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-video-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/afdEndpoints/sdshmcts-prod/routes/vh-video-web"
        name                            = "vh-video-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "c100applicationHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["court-tribunal-hearings"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "courttribunalhearingsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["court-tribunal-hearings-b2c-sign-in"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "courttribunalhearingsb2csigninHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["court-tribunal-hearings-b2c-staff"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "courttribunalhearingsb2cstaffHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dartsportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["dts-legacy-apps---certificatedbailiffs"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dtslegacyappscertificatedbailiffsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["dts-legacy-apps---civilappeals-casetracker"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dtslegacyappscivilappealscasetrackerHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["dts-legacy-apps---courtfines"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dtslegacyappscourtfinesHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["dts-legacy-apps---immigration-appeals-iacfees"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dtslegacyappsimmigrationappealsiacfeesHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["dts-legacy-apps---redirect-service"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dtslegacyappsredirectserviceHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["ejudiciary-home"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "ejudiciaryhomeHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["ejudiciary-home-apex"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "ejudiciaryhomeapexHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["ejudiciary-home-www"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "ejudiciaryhomewwwHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["jd-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "jdbureauHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "jurorbureauHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "jurorpublicHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "portalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "preportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "sdsapimgmtHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["sds-build"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "sdsbuildHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["sds-sandbox-build"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "sdssandboxbuildHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["static-sds-sandbox-build"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "staticsdssandboxbuildHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "toffeeHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhadminwebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhvideowebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "c100applicationHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["court-tribunal-hearings"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "courttribunalhearingsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["court-tribunal-hearings-b2c-sign-in"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "courttribunalhearingsb2csigninHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["court-tribunal-hearings-b2c-staff"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "courttribunalhearingsb2cstaffHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "dartsportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["dts-legacy-apps---certificatedbailiffs"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "dtslegacyappscertificatedbailiffsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["dts-legacy-apps---civilappeals-casetracker"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "dtslegacyappscivilappealscasetrackerHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["dts-legacy-apps---courtfines"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "dtslegacyappscourtfinesHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["dts-legacy-apps---immigration-appeals-iacfees"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "dtslegacyappsimmigrationappealsiacfeesHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["dts-legacy-apps---redirect-service"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "dtslegacyappsredirectserviceHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["ejudiciary-home"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "ejudiciaryhomeHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["ejudiciary-home-apex"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "ejudiciaryhomeapexHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["ejudiciary-home-www"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "ejudiciaryhomewwwHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["jd-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "jdbureauHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "jurorbureauHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "jurorpublicHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "portalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "preportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "sdsapimgmtHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["sds-build"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "sdsbuildHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["sds-sandbox-build"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "sdssandboxbuildHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["static-sds-sandbox-build"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "staticsdssandboxbuildHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "toffeeHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "vhadminwebHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
      + id                       = (known after apply)
      + name                     = "vhvideowebHstsRule"
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 50 to add, 20 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":918,"Program":"tfcmt","SHA1":"","Target":"prod_frontdoor - TerraformPlanApply","Vars":{}} -->